# THIS FILE IS AUTOMATICALLY GENERATED
<<<<<<< Updated upstream
# Project: C:\Users\klabu\Desktop\BrookeResearch\notoriOS\notoriOS.cydsn\notoriOS.cyprj
# Date: Wed, 19 May 2021 20:03:11 GMT
=======
# Project: D:\Github repo\notoriOS\notoriOS.cydsn\notoriOS.cyprj
# Date: Fri, 14 May 2021 23:28:08 GMT
>>>>>>> Stashed changes
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {emFile_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {ADC_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 141 281} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {Clock_IMO} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Debug_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_Telit_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

<<<<<<< Updated upstream
# Component constraints for C:\Users\klabu\Desktop\BrookeResearch\notoriOS\notoriOS.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\klabu\Desktop\BrookeResearch\notoriOS\notoriOS.cydsn\notoriOS.cyprj
# Date: Wed, 19 May 2021 20:02:56 GMT
=======
# Component constraints for D:\Github repo\notoriOS\notoriOS.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Github repo\notoriOS\notoriOS.cydsn\notoriOS.cyprj
# Date: Fri, 14 May 2021 23:27:51 GMT
>>>>>>> Stashed changes
